---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPlacement.PostPattern
source: html/d95f08c8-4d68-4af3-7b4d-c8929848be95.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPlacement.PostPattern Property

Accesses the object containing properties related to the post pattern.

## Syntax (C#)
```csharp
public PostPattern PostPattern { get; }
```